In [122]:
import pandas as pd
data = {'Name':['emaan','sarim','abbas'], 'Age':[19,22,21]}
data = pd.Series(data)
print(data.shape)
data

(2,)

'emaan'

In [47]:
data = {'Name':['emaan','sarim','abbas'], 'Age':[19,22,21]}
data=pd.DataFrame(data)
data

    Name  Age
0  emaan   19
1  sarim   22
2  abbas   21

In [23]:
# data = {'Name':['emaan','sarim','abbas'], 'Age':[19,22,21]}
# for name in data:
#     print(name)

Name
Age

In [25]:
# data = {'Name':['emaan','sarim','abbas'], 'Age':[19,22,21]}
# l1=list(data.values())
# print(l1)
# l2=list(i for i in data.values())
# print(l2)

[['emaan', 'sarim', 'abbas'], [19, 22, 21]]
[['emaan', 'sarim', 'abbas'], [19, 22, 21]]

In [97]:
data.head()
data.tail()
data.columns=['name','age']
data['age'][data['age'] == '19'] = 19
data

    name age
0  emaan  19
1  sarim  22
2  abbas  21
3  arham  22

In [98]:
data= data.rename(columns = {'name':'Name', 'age': 'Age'})
data

    Name Age
0  emaan  19
1  sarim  22
2  abbas  21
3  arham  22

In [100]:
sex=['Female','Male','Male','Male']
data.insert(2,'Sex',sex)
data

    Name Age     Sex
0  emaan  19  Female
1  sarim  22    Male
2  abbas  21    Male
3  arham  22    Male

In [101]:
data.drop(labels=['Sex'],inplace =True, axis=1)
data

    Name Age
0  emaan  19
1  sarim  22
2  abbas  21
3  arham  22

In [110]:
nrow_in_dictform = {'Name':'arham', 'Age': 22}
data = data.append(nrow_in_dictform, ignore_index=True)
data

C:\Users\Dell\AppData\Local\Temp\ipykernel_8900\4186099156.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = data.append(nrow_in_dictform, ignore_index=True)

    Name Age
0  emaan  19
1  sarim  22
2  abbas  21
3  arham  22

In [108]:
data.drop(labels=[3], axis=0, inplace=True)

In [109]:
data

    Name Age
0  emaan  19
1  sarim  22
2  abbas  21

In [105]:
data.iloc[0][1]

19

In [106]:
data.iloc[2:,:]

    Name Age
2  abbas  21
3  arham  22

In [112]:
data.sort_values('Age', inplace=True)
data

    Name Age
0  emaan  19
2  abbas  21
1  sarim  22
3  arham  22

In [113]:
data.at[0,'Age']

19

In [114]:
data['Name'] = data['Name'].str[:2]
data['Name']

0    em
2    ab
1    sa
3    ar
Name: Name, dtype: object

In [120]:
data.at[0,'Name']= data['Name'].str[:3]